'use strict';

// Модуль 4 урок 4

// ✔ Создайте константу rain
// ✔ с помощью Math.Random и Math.round напишите выражение, которое будет возвращать 1 или 0
// ✔ Далее используя условную конструкцию выведите сообщение,
// если rain = 1
// Пошёл дождь. Возьмите зонт!
// если rain = 0
// Дождя нет!

const rain = Math.round(Math.random());

if(rain === 1) {
    console.log("Пошёл дождь. Возьмите зонт!");
}
if(rain === 0) {
    console.log("Дождя нет!");
}


// ✔ Артур хочет поступить на бюджет в институт, для этого ему нужно хорошо сдать три экзамена и набрать минимум 265 баллов.
// ✔ Напишите программу, которая запрашивает у пользователя (prompt) результаты экзаменов по трём направлениям и проверяет, поступил он в институт или нет.

// Пример:
// Введите кол-во баллов по математике: 85
// Введите кол-во баллов по русскому языку: 75
// Введите кол-во баллов по информатике: 95
// Поздравляю, вы поступили на бюджет!

const maths = +prompt("Введите кол-во баллов по математике");
const russian = +prompt("Введите кол-во баллов по русскому языку");
const informatics = +prompt("Введите кол-во баллов по информатике");

const result = maths + russian + informatics;

if(result >= 265) {
    console.log("Поздравляю, вы поступили на бюджет!");
} else {
    console.log("Сожалею, вы не поступили");
}

// ✔ Вам необходимо написать программу для банкомата, который может выдавать минимальные купюры 100р
// ✔ Владимир хочет снять деньги в банкомате, с помощью prompt спросите сколько денег он хочет снять
// ✔ Ваша программа должна проверить, сможет ли банкомат выдать сумму, которую запросил Владимир
// ✔ Выведите сообщение в консоль

const moneySum = +prompt("Сколько денег вы хотите снять?");

if(moneySum % 100 === 0 && moneySum > 0) {
    console.log("Заберите купюры");
} else {
    console.log("Введите сумму, кратную 100р");
}
